## Decision Tree model to predict the salary based on company & job & degree

In [18]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn import tree

In [11]:
data=pd.read_csv("/Users\AnithaGandluri/OneDrive/Anitha/Project management/Data Science/New folder/salaries.csv")
data.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [10]:
inputs=data.drop("salary_more_then_100k",axis="columns")
target=data["salary_more_then_100k"]

In [12]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [25]:
inputs["company_n"]=le_company.fit_transform(inputs["company"])
inputs["job_n"]=le_company.fit_transform(inputs["job"])
inputs["degree_n"]=le_company.fit_transform(inputs["degree"])
inputs.head()

KeyError: 'company'

In [26]:
inputs_n=inputs.drop(["company","job","degree"],axis="columns")
inputs_n.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [19]:
model=tree.DecisionTreeClassifier()

In [20]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [21]:
model.score(inputs_n,target)

1.0

In [23]:
model.predict([[2,2,0]])

C:\Users\AnithaGandluri\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

## Predict the survival rate of the people who travelled in titanic ship

In [57]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [49]:
data=pd.read_csv("/Users\AnithaGandluri/OneDrive/Anitha/Project management/Data Science/New folder/titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
target=data["Survived"]

In [51]:
inputs=data.drop(["PassengerId","Survived","Name","Ticket","SibSp","Parch","Cabin","Embarked"],axis="columns")
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [52]:
le_Pclass=LabelEncoder()
le_Sex=LabelEncoder()
le_Age=LabelEncoder()
le_Fare=LabelEncoder()

In [53]:
inputs["Pclass_n"]=le_Pclass.fit_transform(inputs["Pclass"])
inputs["Sex_n"]=le_Pclass.fit_transform(inputs["Sex"])
inputs["Age_n"]=le_Pclass.fit_transform(inputs["Age"])
inputs["Fare_n"]=le_Pclass.fit_transform(inputs["Pclass"])

In [54]:
inputs.head()

   Pclass     Sex   Age     Fare  Pclass_n  Sex_n  Age_n  Fare_n
0       3    male  22.0   7.2500         2      1     28       2
1       1  female  38.0  71.2833         0      0     51       0
2       3  female  26.0   7.9250         2      0     34       2
3       1  female  35.0  53.1000         0      0     47       0
4       3    male  35.0   8.0500         2      1     47       2

In [55]:
inputs_n=inputs.drop(["Pclass","Sex","Age","Fare"],axis="columns")
inputs_n.head()

   Pclass_n  Sex_n  Age_n  Fare_n
0         2      1     28       2
1         0      0     51       0
2         2      0     34       2
3         0      0     47       0
4         2      1     47       2

In [58]:
X_train, X_test, y_train, y_test = train_test_split(inputs_n,target,test_size=0.2)

In [60]:
len(X_train), len(X_test), len(y_train), len(y_test)

(712, 179, 712, 179)

In [61]:
len(inputs_n)

891

In [63]:
model=tree.DecisionTreeClassifier()

In [64]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [66]:
model.score(X_train,y_train)

0.8806179775280899

In [68]:
model.score(X_test,y_test)

0.8770949720670391

## Decision Tree on Employee Iteration rate

In [1]:
import pandas as pd
import numpy as np
from sklearn import tree
from sklearn.preprocessing import LabelEncoder

In [3]:
data= pd.read_csv("/Users\AnithaGandluri/OneDrive/Anitha/Project management/Data Science/New folder/HR-Employee-Attrition.csv")
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [ ]:
t